app/views/personal_data/index.html.erb

    <div id="employments-data">
      <%= render partial: "employments/employment", collection: @personal_data&.take&.employments,
           as: :employment, locals: {editable: true} %>
---
SELECT `employments`.* FROM `employments`