app/controllers/employments_controller.rb

  def create
    @employment = @personal_datum.employments.build(employment_params)

    respond_to do |format|
      if @employment.save
---
INSERT INTO `employments` (`employer`, `date_started`, `date_ended`, `personal_datum_id`, `created_at`, `updated_at`) VALUES ('Devs', '2023-02-03', '2023-02-03', 1, '2023-02-03 13:48:30.398011', '2023-02-03 13:48:30.398011')

  def update
    respond_to do |format|
      if @employment.update(employment_params)
---
UPDATE `employments` SET `employments`.`employer` = 'asfsa w', `employments`.`updated_at` = '2023-02-03 16:56:32.406662' WHERE `employments`.`id` = 1

  def set_employment
    @employment = Employment.find(params[:id])
---
SELECT `employments`.* FROM `employments` WHERE `employments`.`id` = 1 LIMIT 1