app/controllers/personal_data_controller.rb

SELECT `employments`.* FROM `employments` WHERE `employments`.`personal_datum_id` = 2
---
  def index
    @personal_data = PersonalDatum.includes(:employment)